Процедура ПечатьЗаявки(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ЗаявкаНаТранспорт.ПолучитьМакет("ПечатьЗаявки");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаТранспорт.Адрес КАК Адрес,
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяТовары.Цена КАК Цена,
	|	РасходнаяНакладнаяТовары.Количество КАК Количество,
	|	РасходнаяНакладнаяТовары.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|		ПО ЗаявкаНаТранспорт.ДокументОснование.Ссылка = РасходнаяНакладнаяТовары.Ссылка
	|ГДЕ
	|	ЗаявкаНаТранспорт.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	Адрес";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
	ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьШапка);
		
		ТабДок.Вывести(ОбластьШапкаТЧ);
		
		ВыбратьПоТоварам = Выборка.Выбрать();
		
		Пока ВыбратьПоТоварам.Следующий() Цикл
			
			ОбластьСтрокаТЧ.Параметры.Заполнить(ВыбратьПоТоварам);
			ТабДок.Вывести(ОбластьСтрокаТЧ);

		КонецЦикла;
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры