
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Если ДанныеЗаполнения.Товары.Итог("Сумма") > 1000 Тогда
			
			// Заполнение шапки
			КонтактноеЛицо = ДанныеЗаполнения.КонтактноеЛицо;
			Контрагент = ДанныеЗаполнения.Контрагент;
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			Телефон = КонтактноеЛицо.Телефон;
			Адрес = КонтактноеЛицо.Адрес;
			
		Иначе
			
			ВызватьИсключение "Сумма расходной накладной меньше 1000";
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СтатусыМашин
	Движения.СтатусыМашин.Записывать = Истина;
	Движение = Движения.СтатусыМашин.Добавить();
	Движение.Период = Дата;
	Движение.ТранспортноеСредство = ТранспортноеСредство;
	Движение.Статус = СтатусЗаявки;
	
	
	
	// регистр ДанныеПоВодителям
	Если СтатусЗаявки = Перечисления.СостояниеЗаказа.Отработано Тогда
		
		Движения.ДанныеВодителей.Записывать = Истина;
		Движение = Движения.ДанныеВодителей.Добавить();

		Движение.Водитель = Водитель;
		Движение.ДокументОснование = Ссылка;
		Движение.Километраж = Километраж;

	КонецЕсли;

КонецПроцедуры
