
&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставБригад.Водитель КАК Водитель,
		|	СоставБригад.ГрузчикОдин КАК ГрузчикОдин,
		|	СоставБригад.ГрузчикДва КАК ГрузчикДва,
		|	СоставБригад.ТранспортноеСредство КАК ТранспортноеСредство
		|ИЗ
		|	РегистрСведений.СоставБригад КАК СоставБригад
		|ГДЕ
		|	СоставБригад.Период = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Объект.ДатаДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Объект.Водитель 		= Выборка.Водитель;
		Объект.ГрузчикОдин 	= Выборка.ГрузчикОдин;
		Объект.ГрузчикДва 	= Выборка.ГрузчикДва;
		
	Иначе
		
		Объект.ТранспортноеСредство  = Справочники.ТранспортныеСрества.ПустаяСсылка();
		Объект.Водитель 				= Справочники.Сотрудники.ПустаяСсылка();
		Объект.ГрузчикОдин 			= Справочники.Сотрудники.ПустаяСсылка();
		Объект.ГрузчикДва 			= Справочники.Сотрудники.ПустаяСсылка();
		
		Сообщить("На данный день еще не назначена бригада!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаДоставкиПриИзменении(Элемент)
	
	Если Объект.ДатаДоставки < ТекущаяДата() Тогда 
		
		Сообщить("Дата доставки не может быть раньше текущей");
		
	КонецЕсли;
	
КонецПроцедуры
